src/cf/InformationRegisters/вогНастройкиНачальнойСтраницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогНастройкиНачальнойСтраницы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отображать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Виджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВиджетыРабочегоСтола</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/вогВиджетыРабочегоСтола.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>вогВиджетыРабочегоСтола</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиВиджета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполняемыйКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/вогНастройкиНачальнойСтраницы/Forms/ФормаНастройки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вогВиджетыРабочегоСтола.Наименование КАК Наименование,
		|	вогВиджетыРабочегоСтола.Ссылка КАК Виджет,
		|	ЕСТЬNULL(вогНастройкиНачальнойСтраницы.Порядок, вогВиджетыРабочегоСтола.Порядок) КАК Порядок,
		|	ЕСТЬNULL(вогНастройкиНачальнойСтраницы.Отображать, ИСТИНА) КАК Отображать
		|ИЗ
		|	Справочник.вогВиджетыРабочегоСтола КАК вогВиджетыРабочегоСтола
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вогНастройкиНачальнойСтраницы КАК вогНастройкиНачальнойСтраницы
		|		ПО (вогНастройкиНачальнойСтраницы.Виджет = вогВиджетыРабочегоСтола.Ссылка)
		|			И (вогНастройкиНачальнойСтраницы.Пользователь = &Пользователь)
		|ГДЕ
		|	НЕ вогВиджетыРабочегоСтола.Отключен
		|	И НЕ вогВиджетыРабочегоСтола.ПометкаУдаления
		|	И вогВиджетыРабочегоСтола.Предопределенный
		// +++ VOG Кулаков П.Л. 18.02.2021 DEV-177
		|	И ВЫБОР
		|			КОГДА &ВыводитьВиджетПродажи
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ вогВиджетыРабочегоСтола.Ссылка <> ЗНАЧЕНИЕ(Справочник.вогВиджетыРабочегоСтола.МоиПродажи)
		|					И вогВиджетыРабочегоСтола.Ссылка <> ЗНАЧЕНИЕ(Справочник.вогВиджетыРабочегоСтола.МоиПродажиКвартал)
		|		КОНЕЦ
		// --- VOG Кулаков П.Л.
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	Запрос.УстановитьПараметр("Пользователь",Пользователи.ТекущийПользователь());
	// +++ VOG Кулаков П.Л. 18.02.2021 DEV-177
	Запрос.УстановитьПараметр("ВыводитьВиджетПродажи",Обработки.вогНачальнаяСтраницаПользователя.ВыводитьВиджетПродажи());
	// --- VOG Кулаков П.Л.
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокВиджетов.Добавить(ВыборкаДетальныеЗаписи.Виджет,ВыборкаДетальныеЗаписи.Наименование,ВыборкаДетальныеЗаписи.Отображать);
		// +++ VOG Кулаков П.Л. 17.02.2021 DEV-179
		СписокВиджетовНачальный.Добавить(ВыборкаДетальныеЗаписи.Виджет,ВыборкаДетальныеЗаписи.Наименование,ВыборкаДетальныеЗаписи.Отображать);
		// --- VOG Кулаков П.Л.
	КонецЦикла;
	
		
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	// +++ VOG Кулаков П.Л. 17.02.2021 DEV-179
	ЗаписьВРегистрПроизведена =	ГотовоНаСервере();
	Если ЗаписьВРегистрПроизведена Тогда
		Оповестить("ОбновитьПриветственнуюИнформацию");
	КонецЕсли;
	// --- VOG Кулаков П.Л.
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ГотовоНаСервере()
	
	// +++ VOG Кулаков П.Л. 17.02.2021 DEV-179
	Если ОбщегоНазначения.КоллекцииИдентичны(СписокВиджетов,СписокВиджетовНачальный,,,Истина) Тогда
		Возврат Ложь;
	КонецЕсли;
	// --- VOG Кулаков П.Л.
	
	Порядок = 1;
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Для Каждого Строка Из СписокВиджетов Цикл
		МенеджерЗаписи = РегистрыСведений.вогНастройкиНачальнойСтраницы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Пользователь = ТекущийПользователь;
		МенеджерЗаписи.Виджет = Строка.Значение;
		МенеджерЗаписи.Отображать = Строка.Пометка;
		МенеджерЗаписи.Порядок = Порядок;
		МенеджерЗаписи.Записать();
		Порядок = Порядок + 1;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции
